/**********************************************************
**0000000000000000000000000000000000000000000000000000000**
**00                                                   00**
**00               东秦全向三队 编写                   00**
**00             队员 ：陈诏栋 刘坤龙 石柳苗                                              00**
**00                                                   00**
**0000000000000000000000000000000000000000000000000000000**
**00            函数作用：  总init                       00**
**0000000000000000000000000000000000000000000000000000000**
**********************************************************/

#include "include.h"

void hcar_init(void)
{
    GPIO_LED_Init();
    GPIO_KEY_Init();

    UART_InitConfig(USART2,115200,UART2_TX_A2,UART2_RX_A3); //初始化串口2 波特率 115200 无奇偶校验 1停止位 使用管脚
    //UART_PutStr(USART2," UART2 LongQiu \r\n");

    EncInit();

    //adc_init();
    //servo_init();

}
