/*LLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLL
【平    台】北京龙邱智能科技CH32V103R8T6核心板
【编    写】chiusir
【E-mail  】chiusir@163.com
【软件版本】V1.0 版权所有，单位使用请先联系授权
【最后更新】2020年12月24日，持续更新，请关注最新版！
【相关信息参考下列地址】
【网    站】http://www.lqist.cn
【淘宝店铺】http://longqiu.taobao.com
------------------------------------------------
【IDE】CH32V103R8T6:MounRiver Studio及以上版本
【Target 】 CH32V103R8T6
【SYS PLL】 72-96-112MHz 频率太高可能无法启动system_ch32v10x.c
=================================================================
程序配套视频地址：https://space.bilibili.com/95313236
=================================================================
CH32V103第一核心板：
-----------------------------------------------------------------
默认电机接口
使用TIM3块，四个通道可产生4路PWM
双路接口2
PC9          TIM3CH4    龙邱双核母板MOTOR3_P
PC12         GPIO       龙邱双核母板MOTOR3_N
PC7          TIM3CH2    龙邱双核母板MOTOR4_P
PC13         GPIO       龙邱双核母板MOTOR4_N
双路接口1
PC8          TIM3CH3    龙邱双核母板MOTOR1_P
PC10         GPIO       龙邱双核母板MOTOR1_N
PC6          TIM3CH1    龙邱双核母板MOTOR2_P
PC11         GPIO       龙邱双核母板MOTOR2_N
-----------------------------------------------------------------
默认屏幕显示接口，用户可以使用TFT或者OLED模块
TFTSPI_CS     PB13      龙邱双核母板 CS管脚 默认拉低，可以不用
TFTSPI_SCK    PB15      龙邱双核母板 SPI SCK管脚
TFTSPI_SDI    PB14      龙邱双核母板 SPI MOSI管脚
TFTSPI_DC     PB12      龙邱双核母板 D/C管脚
TFTSPI_RST    PB11      龙邱双核母板 RESET管脚
-----------------------------------------------------------------
OLED_CK       PB13      龙邱双核母板OLED CK管脚
OLED_DI       PB15      龙邱双核母板OLED DI管脚
OLED_RST      PB14      龙邱双核母板OLED RST管脚
OLED_DC       PB12      龙邱双核母板OLED DC管脚
OLED_CS       PB11      龙邱双核母板OLED CS管脚 默认拉低，可以不用
----------------------------------------------------------------
默认按键接口
KEY0p         PC3       龙邱双核母板上按键0
KEY1p         PC2       龙邱双核母板上按键1
KEY2p         PC1       龙邱双核母板上按键2
DSW0p         PB4       龙邱双核母板上拨码开关0
DSW1p         PB5       龙邱双核母板上拨码开关1
-----------------------------------------------------------------
默认LED接口
LED0p         新版PC4/原始A3    龙邱SPIN27PS核心板上LED0 翠绿
LED1p         PB10      龙邱SPIN27PS核心板上LED0 翠绿
-----------------------------------------------------------------
默认蜂鸣器接口
BEEPp         PD2       龙邱双核母板上蜂鸣器接口
干簧管接口
REEDp         PB3       龙邱双核母板上干簧管接口
-----------------------------------------------------------------
CH32V103第二核心板：：

摄像头接口                  龙邱神眼或者OV7725模块
● 数据端口：PC8-PC15口，共8位，接摄像头的数据端口；
● 时钟像素：外部中断PB1；
● 行信号：  外部中断PC3/如果用DMA+TIMER1:PA12/如果用DMA+TIMER3:PD2
● 场信号：  外部中断PB4
● I2C：     PB8 I2C1-SCL
PB9 I2C1-SDA
-----------------------------------------------------------------
默认舵机接口
使用TIM3块，四个通道可产生4路PWM
PC6        龙邱双核母板舵机
-----------------------------------------------------------------
正交解码增量编码器信号采集，任意选择四路即可；
TIM2:
PA15 PB3   龙邱双核母板编码器1
TIM4
PB7 PB6    龙邱双核母板编码器2
-----------------------------------------------------------------
电感电压采集模块
推荐使用ADC0-1+4-9，共8路ADC，可以满足电磁车电感电压采集；
电源采集用ADC10:  CH32V103:C0 / SPIN27PS：B2;
-----------------------------------------------------------------

QQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQ*/
#include "include.h"
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////配置在"LQ_Config.h"文件中，不要两个单片机同时使用屏幕
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////


int main(void)
{
    hcar_gogogo();
}




